## Final Project
**Authors:** Nick Romano and Trevor McCormick   
**Version 1.0**   
**DS160-01: Introduction to Data Science**   
---

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

#### Reading in Data

In [2]:
df_traffic = pd.read_csv("Dodgers.data", header = None)
df_games = pd.read_csv("Dodgers.events", header = None)

In [3]:
df_traffic

                     0  1
0       4/10/2005 0:00 -1
1       4/10/2005 0:05 -1
2       4/10/2005 0:10 -1
3       4/10/2005 0:15 -1
4       4/10/2005 0:20 -1
...                ... ..
50395  10/1/2005 23:35 -1
50396  10/1/2005 23:40 -1
50397  10/1/2005 23:45 -1
50398  10/1/2005 23:50 -1
50399  10/1/2005 23:55 -1

[50400 rows x 2 columns]

In [4]:
df_games

           0         1         2      3              4       5
0   04/12/05  13:10:00  16:23:00  55892  San Francisco  W 9-8�
1   04/13/05  19:10:00  21:48:00  46514  San Francisco  W 4-1�
2   04/15/05  19:40:00  21:48:00  51816      San Diego  W 4-0�
3   04/16/05  19:10:00  21:52:00  54704      San Diego  W 8-3�
4   04/17/05  13:10:00  15:31:00  53402      San Diego  W 6-0�
..       ...       ...       ...    ...            ...     ...
76  09/25/05  13:10:00  16:06:00  37846     Pittsburgh  W 9-2�
77  09/26/05  19:10:00  22:27:00  36397     Pittsburgh  W 9-4�
78  09/27/05  19:10:00  21:33:00  42604        Arizona  L 2-0�
79  09/28/05  19:10:00  21:58:00  46424        Arizona  L 4-3�
80  09/29/05  19:10:00  22:24:00  45053        Arizona  L 3-2�

[81 rows x 6 columns]

In [5]:
df_traffic.to_csv("Original_Dodgers_Traffic.csv", index=False, header=False)

In [6]:
df_games.to_csv("Original_Dodgers_Events.csv", index=False, header=False)

We ended up saving an original version of the Dodgers.data and Dodgers.events data frames as .csv files to have a version in that format

---
#### Cleaning up the data


   
**df_games cleanup**

In [7]:
df_games

           0         1         2      3              4       5
0   04/12/05  13:10:00  16:23:00  55892  San Francisco  W 9-8�
1   04/13/05  19:10:00  21:48:00  46514  San Francisco  W 4-1�
2   04/15/05  19:40:00  21:48:00  51816      San Diego  W 4-0�
3   04/16/05  19:10:00  21:52:00  54704      San Diego  W 8-3�
4   04/17/05  13:10:00  15:31:00  53402      San Diego  W 6-0�
..       ...       ...       ...    ...            ...     ...
76  09/25/05  13:10:00  16:06:00  37846     Pittsburgh  W 9-2�
77  09/26/05  19:10:00  22:27:00  36397     Pittsburgh  W 9-4�
78  09/27/05  19:10:00  21:33:00  42604        Arizona  L 2-0�
79  09/28/05  19:10:00  21:58:00  46424        Arizona  L 4-3�
80  09/29/05  19:10:00  22:24:00  45053        Arizona  L 3-2�

[81 rows x 6 columns]

In [8]:
df_games = df_games.rename(columns = {0: 'Date', 
                                      1: 'Starttime',
                                      2: 'Endtime',
                                      3: 'Total Attendance',
                                      4: 'Opponent',
                                      5: 'Result'})

In [9]:
df_games

        Date Starttime   Endtime  Total Attendance       Opponent  Result
0   04/12/05  13:10:00  16:23:00             55892  San Francisco  W 9-8�
1   04/13/05  19:10:00  21:48:00             46514  San Francisco  W 4-1�
2   04/15/05  19:40:00  21:48:00             51816      San Diego  W 4-0�
3   04/16/05  19:10:00  21:52:00             54704      San Diego  W 8-3�
4   04/17/05  13:10:00  15:31:00             53402      San Diego  W 6-0�
..       ...       ...       ...               ...            ...     ...
76  09/25/05  13:10:00  16:06:00             37846     Pittsburgh  W 9-2�
77  09/26/05  19:10:00  22:27:00             36397     Pittsburgh  W 9-4�
78  09/27/05  19:10:00  21:33:00             42604        Arizona  L 2-0�
79  09/28/05  19:10:00  21:58:00             46424        Arizona  L 4-3�
80  09/29/05  19:10:00  22:24:00             45053        Arizona  L 3-2�

[81 rows x 6 columns]

In [10]:
print(min(df_games.Endtime))
print(max(df_games.Endtime))

14:39:00
23:18:00

In [11]:
df_games.Date = df_games.Date.astype(str) + " " + df_games.Starttime.astype(str)
df_games.Date = pd.to_datetime(df_games.Date)

df_games.Endtime = df_games.Date.astype(str) + " " + df_games.Endtime.astype(str)
df_games.Endtime = pd.to_datetime(df_games.Endtime)

df_games.drop(columns=['Starttime', 'Result'], axis = 1, inplace=True)
df_games.rename(columns = {'Date': 'Starttime'}, inplace=True)

In [12]:
df_games.dtypes

Starttime           datetime64[ns]
Endtime             datetime64[ns]
Total Attendance             int64
Opponent                    object
dtype: object

In [13]:
df_games

             Starttime             Endtime  Total Attendance       Opponent
0  2005-04-12 13:10:00 2005-04-12 16:23:00             55892  San Francisco
1  2005-04-13 19:10:00 2005-04-13 21:48:00             46514  San Francisco
2  2005-04-15 19:40:00 2005-04-15 21:48:00             51816      San Diego
3  2005-04-16 19:10:00 2005-04-16 21:52:00             54704      San Diego
4  2005-04-17 13:10:00 2005-04-17 15:31:00             53402      San Diego
..                 ...                 ...               ...            ...
76 2005-09-25 13:10:00 2005-09-25 16:06:00             37846     Pittsburgh
77 2005-09-26 19:10:00 2005-09-26 22:27:00             36397     Pittsburgh
78 2005-09-27 19:10:00 2005-09-27 21:33:00             42604        Arizona
79 2005-09-28 19:10:00 2005-09-28 21:58:00             46424        Arizona
80 2005-09-29 19:10:00 2005-09-29 22:24:00             45053        Arizona

[81 rows x 4 columns]

In [14]:
df_games.to_csv("New_Dodgers_Events.csv", index=False)

**df_traffic clean up**

In [15]:
df_traffic

                     0  1
0       4/10/2005 0:00 -1
1       4/10/2005 0:05 -1
2       4/10/2005 0:10 -1
3       4/10/2005 0:15 -1
4       4/10/2005 0:20 -1
...                ... ..
50395  10/1/2005 23:35 -1
50396  10/1/2005 23:40 -1
50397  10/1/2005 23:45 -1
50398  10/1/2005 23:50 -1
50399  10/1/2005 23:55 -1

[50400 rows x 2 columns]

Renaming column headers that appropriately fit the data

In [16]:
df_traffic = df_traffic.rename(columns = {0: 'Date', 
                                          1: 'Traffic_flow'})

The data within the Date column is represented as object rather than being in Datetime form

In [17]:
df_traffic.dtypes

Date            object
Traffic_flow     int64
dtype: object

In [18]:
df_traffic.Date = pd.to_datetime(df_traffic.Date)
df_traffic.dtypes

Date            datetime64[ns]
Traffic_flow             int64
dtype: object

In [19]:
df_traffic

                     Date  Traffic_flow
0     2005-04-10 00:00:00            -1
1     2005-04-10 00:05:00            -1
2     2005-04-10 00:10:00            -1
3     2005-04-10 00:15:00            -1
4     2005-04-10 00:20:00            -1
...                   ...           ...
50395 2005-10-01 23:35:00            -1
50396 2005-10-01 23:40:00            -1
50397 2005-10-01 23:45:00            -1
50398 2005-10-01 23:50:00            -1
50399 2005-10-01 23:55:00            -1

[50400 rows x 2 columns]

In [20]:
occurance_list = []
for i in range(0, 80):
    a = df_traffic[(df_traffic.Date >= df_games.Starttime[i]) & 
                   (df_traffic.Date <= df_games.Endtime[i])].index.values.tolist()
    for j in a:
        occurance_list.append(j)

In [21]:
df_traffic.insert(2, "Game_Occurance", 0)

In [22]:
for i in occurance_list:
    for j in df_traffic.index.values:
        if j == i:
            df_traffic.Game_Occurance[i] += 1

<ipython-input-22-db78bd819aae>:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_traffic.Game_Occurance[i] += 1

In [23]:
df_traffic.query("Game_Occurance == 1")

                     Date  Traffic_flow  Game_Occurance
734   2005-04-12 13:10:00            32               1
735   2005-04-12 13:15:00            38               1
736   2005-04-12 13:20:00            45               1
737   2005-04-12 13:25:00            33               1
738   2005-04-12 13:30:00            28               1
...                   ...           ...             ...
49507 2005-09-28 21:35:00            35               1
49508 2005-09-28 21:40:00            15               1
49509 2005-09-28 21:45:00            27               1
49510 2005-09-28 21:50:00            33               1
49511 2005-09-28 21:55:00            29               1

[2762 rows x 3 columns]

In [24]:
df_traffic.Game_Occurance.groupby(df_traffic.Game_Occurance).count()

Game_Occurance
0    47638
1     2762
Name: Game_Occurance, dtype: int64

In [25]:
df_traffic.to_csv("New_Dodgers_Traffic.csv", index=False)